In [3]:
import pandas as pd

Reading penguins dataset from CSV file

In [183]:
data=pd.read_csv('D:\courses\course_data\HW9\penguins_size.csv')
data

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [44]:
type(data)

pandas.core.frame.DataFrame

In [157]:
data.shape

(344, 7)

In [52]:
data.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [53]:
data.tail()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

Display of unique species

In [170]:
unique_species = data['species'].unique()
unique_species

array(['Adelie', 'Chinstrap', 'Gentoo'], dtype=object)

In [159]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   culmen_length_mm   342 non-null    float64
 3   culmen_depth_mm    342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                334 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

The number of NaN values in each column

In [202]:
nan_counts=data.isna().sum()
nan_counts

species               0
island                0
culmen_length_mm      2
culmen_depth_mm       2
flipper_length_mm     2
body_mass_g           2
sex                  10
dtype: int64

In [190]:
data.groupby(['island' , 'species'])[['species']].count()

                     species
island    species
Biscoe    Adelie          44
          Gentoo         124
Dream     Adelie          56
          Chinstrap       68
Torgersen Adelie          52

Calculation of the average body mass in each genus of penguins

In [161]:
data.groupby(['sex'])[['body_mass_g']].mean()

        body_mass_g
sex
.       4875.000000
FEMALE  3862.272727
MALE    4545.684524

Calculation of the share of female penguins in each specie

In [199]:
female_penguins = data.loc[data['sex'] == 'FEMALE']
female=female_penguins.groupby(['species'])['sex'].count()
total=data.groupby(['species']).size()
female_share=female/total
print(female)
print(total)
print(female_share)

species
Adelie       73
Chinstrap    34
Gentoo       58
Name: sex, dtype: int64
species
Adelie       152
Chinstrap     68
Gentoo       124
dtype: int64
species
Adelie       0.480263
Chinstrap    0.500000
Gentoo       0.467742
dtype: float64

Calculate the average depth of culmen in each island

In [172]:
data.groupby(['island'])[['culmen_depth_mm']].mean()

           culmen_depth_mm
island
Biscoe           15.874850
Dream            18.344355
Torgersen        18.429412

Calculation of minimum, maximum and average feather length for each species

In [201]:
data.groupby(['species'])[['flipper_length_mm']].agg(['min', 'max', 'mean'])

          flipper_length_mm
                        min    max        mean
species
Adelie                172.0  210.0  189.953642
Chinstrap             178.0  212.0  195.823529
Gentoo                203.0  231.0  217.186992

*Average depth of culmen between males and females in each species & An island that has more culmen depth

In [195]:
grouped_data = data.groupby(['species', 'sex'])['culmen_depth_mm'].mean()
grouped_data = data.groupby(['species', 'sex'])['culmen_depth_mm'].max()
max_culmen_island = grouped_data.idxmax()
print(grouped_data)
print(max_culmen_island)

species    sex
Adelie     FEMALE    20.7
           MALE      21.5
Chinstrap  FEMALE    19.4
           MALE      20.8
Gentoo     .         15.7
           FEMALE    15.5
           MALE      17.3
Name: culmen_depth_mm, dtype: float64
('Adelie', 'MALE')

**Maximum body weight between Chinstrap and Adelie species by sex and species

In [200]:
filtered_data = data[data['species'].isin(['Chinstrap', 'Adelie'])]
grouped_data = filtered_data.groupby(['species', 'sex'])['body_mass_g'].max()
grouped_data

species    sex
Adelie     FEMALE    3900.0
           MALE      4775.0
Chinstrap  FEMALE    4150.0
           MALE      4800.0
Name: body_mass_g, dtype: float64

***Between these three features flipper_length_mm and culmen_length_mm and body_mass_g
According to their species, which feature is more in females and less in males

In [204]:
grouped_data = data.groupby(['species', 'sex'])[['flipper_length_mm', 'culmen_length_mm', 'body_mass_g']].mean()
max_feature_in_females = grouped_data.xs('FEMALE', level='sex').idxmax()
min_feature_in_males = grouped_data.xs('MALE', level='sex').idxmin()
print(grouped_data)
print(max_feature_in_females)
print(min_feature_in_males)

                  flipper_length_mm  culmen_length_mm  body_mass_g
species   sex
Adelie    FEMALE         187.794521         37.257534  3368.835616
          MALE           192.410959         40.390411  4043.493151
Chinstrap FEMALE         191.735294         46.573529  3527.205882
          MALE           199.911765         51.094118  3938.970588
Gentoo    .              217.000000         44.500000  4875.000000
          FEMALE         212.706897         45.563793  4679.741379
          MALE           221.540984         49.473770  5484.836066
flipper_length_mm       Gentoo
culmen_length_mm     Chinstrap
body_mass_g             Gentoo
dtype: object
flipper_length_mm       Adelie
culmen_length_mm        Adelie
body_mass_g          Chinstrap
dtype: object